Конфигурация/Documents/ПереводЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПереводЦенныхБумаг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиЦенныхБумагЗаблокированные</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦенныхБумаг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитарныйСчетПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереводСЗаблокированногоСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ОстаткиЦенныхБумагЗаблокированные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиЦенныхБумагЗаблокированные</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидБлокировкиАктива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыБлокировокАктивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияСделокРЕПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияСделокРЕПО</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВторойЧастиРЕПО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СобственныйКурсОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсОплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПроцент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежноеУсловиеСделки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Comment>Заполняется автоматически на основании части РЕПО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложенноеИсполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаздельноеИсполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СделкаРЕПО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьСделкиРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/РынкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РынкиЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Векселя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечныеСертификатыУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныеРасписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опционы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютныеПары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ПереводЦенныхБумаг/Ext/ObjectModule.bsl
Процедура УстановитьБлокировки()

	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;

	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиЦенныхБумаг");
	
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("ДепозитарныйСчет",             ЭтотОбъект.ДепозитарныйСчет);
	ЭлементБлокировкиДанных.УстановитьЗначение("Рынок",                        ЭтотОбъект.Рынок);
	
	ЭлементБлокировкиДанных.ИсточникДанных = ЭтотОбъект.ЦенныеБумаги;
	ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("ЦеннаяБумага", "ЦеннаяБумага");
	
	Если ЭтотОбъект.ПереводСЗаблокированногоСчета Тогда
		
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиЦенныхБумагЗаблокированные");
		
		ЭлементБлокировкиДанных.УстановитьЗначение("ВидБлокировкиАктива",          Перечисления.ВидыБлокировокАктивов.Погашение);
		ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  ЭтотОбъект.Организация);
		ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		ЭлементБлокировкиДанных.УстановитьЗначение("ДепозитарныйСчет",             ЭтотОбъект.ДепозитарныйСчет);
		ЭлементБлокировкиДанных.УстановитьЗначение("Рынок",                        ЭтотОбъект.Рынок); 		
		
		ЭлементБлокировкиДанных.ИсточникДанных = ЭтотОбъект.ЦенныеБумаги;
		ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("ЦеннаяБумага", "ЦеннаяБумага");
	
	КонецЕсли;
	
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры // УстановитьБлокировки

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки();
	
	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.ОстаткиЦенныхБумаг.Записывать 					= Истина;
	Движения.ОстаткиЦенныхБумагЗаблокированные.Записывать 	= Истина;

	Для каждого СтрокаЦенныеБумаги Из ЭтотОбъект.ЦенныеБумаги Цикл
		
		// расход ц/б
		Движение = Движения.ОстаткиЦенныхБумаг.ДобавитьРасход();
		Движение.Период                       = ЭтотОбъект.Дата;
		Движение.Организация                  = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.ДепозитарныйСчет             = ЭтотОбъект.ДепозитарныйСчет;
		Движение.Рынок                        = ЭтотОбъект.Рынок;
		Движение.ЦеннаяБумага                 = СтрокаЦенныеБумаги.ЦеннаяБумага;
		Движение.Количество                   = СтрокаЦенныеБумаги.Количество;
				
		// приход ц/б
		Движение = Движения.ОстаткиЦенныхБумаг.ДобавитьПриход();
		Движение.Период                       = ЭтотОбъект.Дата;
		Движение.Организация                  = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.ДепозитарныйСчет             = ЭтотОбъект.ДепозитарныйСчетПолучатель;
		Движение.Рынок                        = ЭтотОбъект.Рынок;
		Движение.ЦеннаяБумага                 = СтрокаЦенныеБумаги.ЦеннаяБумага;
		Движение.Количество                   = СтрокаЦенныеБумаги.Количество;
		
		Если ЭтотОбъект.ПереводСЗаблокированногоСчета Тогда
			
			// расход ц/б заблокированных
			Движение = Движения.ОстаткиЦенныхБумагЗаблокированные.ДобавитьРасход();
			Движение.ВидБлокировкиАктива		  = Перечисления.ВидыБлокировокАктивов.Погашение;		
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.ДепозитарныйСчет             = ЭтотОбъект.ДепозитарныйСчет;
			Движение.Рынок                        = ЭтотОбъект.Рынок;
			Движение.ЦеннаяБумага                 = СтрокаЦенныеБумаги.ЦеннаяБумага;
			Движение.Количество                   = СтрокаЦенныеБумаги.Количество;
					
			// приход ц/б заблокированных
			Движение = Движения.ОстаткиЦенныхБумагЗаблокированные.ДобавитьПриход();
			Движение.ВидБлокировкиАктива		  = Перечисления.ВидыБлокировокАктивов.Погашение;
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.ДепозитарныйСчет             = ЭтотОбъект.ДепозитарныйСчетПолучатель;
			Движение.Рынок                        = ЭтотОбъект.Рынок;
			Движение.ЦеннаяБумага                 = СтрокаЦенныеБумаги.ЦеннаяБумага;
			Движение.Количество                   = СтрокаЦенныеБумаги.Количество;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.Записать();
	
	// проверим отрицательные остатки
	РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиЦенныхБумаг(ЭтотОбъект, Отказ);
	Если ЭтотОбъект.ПереводСЗаблокированногоСчета Тогда
		РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиЦенныхБумагЗаблокированных(ЭтотОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура ПроверитьПереводМеждуСпецдепами(Отказ)
	
	ДепозитарийОтправитель 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.ДепозитарныйСчет, 			"Депозитарий");
	ДепозитарийПолучатель 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.ДепозитарныйСчетПолучатель, 	"Депозитарий");
	
	Если ДепозитарийОтправитель = ДепозитарийПолучатель Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО КАК СделкаРЕПО,
	    |	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО КАК ДатаВозврата,
	    |	ЗадолженностиПоВторойЧастиРЕПООстатки.ЦеннаяБумага В (&ЦенныеБумаги)
	    |		ИЛИ ЗадолженностиПоВторойЧастиРЕПООстатки.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)) КАК БлокироватьПроведение
	    |ИЗ
	    |	РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(
	    |			&ПериодГраница,
	    |			Организация = &Организация
	    |				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	    |				И Рынок = &Рынок) КАК ЗадолженностиПоВторойЧастиРЕПООстатки
	    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
	    |				&ПериодГраница,
	    |				Организация = &Организация
	    |					И ДепозитарныйСчет = &ДепозитарныйСчет
	    |					И Рынок = &Рынок
	    |					И ЧастьСделкиРЕПО = 1) КАК УсловияСделокРЕПОСрезПоследних
	    |		ПО ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
	    |			И ЗадолженностиПоВторойЧастиРЕПООстатки.ЦеннаяБумага = УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага
	    |ГДЕ
	    |	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО > &Период");
	
	Запрос.УстановитьПараметр("Период", 						КонецДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("ПериодГраница", 					Новый Граница(КонецДня(ЭтотОбъект.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",                  	ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ДепозитарныйСчет",             	ЭтотОбъект.ДепозитарныйСчет);
	Запрос.УстановитьПараметр("Рынок",                        	ЭтотОбъект.Рынок);
	Запрос.УстановитьПараметр("ЦенныеБумаги", 					ЭтотОбъект.ЦенныеБумаги.ВыгрузитьКолонку("ЦеннаяБумага"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У сделки РЕПО " + СокрЛП(Выборка.СделкаРЕПО) + " дата второй части " + Формат(Выборка.ДатаВозврата, "ДФ=dd.MM.yyyy") + " позже даты перевода", Выборка.СделкаРЕПО);
		Отказ = Макс(Отказ, Выборка.БлокироватьПроведение);
	КонецЦикла;
		
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		// ценная бумага должна быть уникальной
		РазличныеЦенныеБумаги = ЭтотОбъект.ЦенныеБумаги.Выгрузить(, "ЦеннаяБумага");
		РазличныеЦенныеБумаги.Свернуть("ЦеннаяБумага");
		
		Если ЭтотОбъект.ЦенныеБумаги.Количество() <> РазличныеЦенныеБумаги.Количество()  Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ценная бумага может быть выбрана в табличной части только один раз!", ЭтотОбъект.ЦенныеБумаги,,, Отказ);
		КонецЕсли;
		
		ТипЦеннойБумаги = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(ЭтотОбъект.Рынок);
		
		Для НомСтр = 0 По ЭтотОбъект.ЦенныеБумаги.Количество() - 1 Цикл
			СтрокаЦенныеБумаги = ЭтотОбъект.ЦенныеБумаги[НомСтр];
			
			// для рынка векселей проверим количество
			Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Векселя И СтрокаЦенныеБумаги.Количество <> 1 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Количество векселей в строке № " + (НомСтр + 1) + " отлично от 1. Обратитесь к разработчикам.",,,, Отказ);
			КонецЕсли;
			
			// проверим, что рынок соответствует типу ценной бумаги
			Если Не ТипЦеннойБумаги.СодержитТип(ТипЗнч(СтрокаЦенныеБумаги.ЦеннаяБумага)) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Тип ценной бумаги в строке № " + (НомСтр + 1) + " не соответствует рынку " + ЭтотОбъект.Рынок + ".",,,, Отказ);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// При переводе между спец. депами нужно проверить, что нет незавершенных сделок РЕПО с датой второй части позже даты перевода
	ПроверитьПереводМеждуСпецдепами(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);

КонецПроцедуры

#КонецОбласти
